[Killed] BlockStatement
src/app/calendar/calendar.component.ts:13:19
     firstNumber! : number;
     secondNumber!: number;
   
-    add(): number {
-      return this.firstNumber + this.secondNumber;
-    }
+    add(): number {}
   
     subtract(): number {
killedBy: CalendarComponent should add two numbers
statusReason: Expected undefined to equal 120.

[Killed] ArithmeticOperator
src/app/calendar/calendar.component.ts:14:14
     secondNumber!: number;
   
     add(): number {
-      return this.firstNumber + this.secondNumber;
+      return this.firstNumber - this.secondNumber;
     }
   
killedBy: CalendarComponent should add two numbers
statusReason: Expected -20 to equal 120.

[Killed] BlockStatement
src/app/calendar/calendar.component.ts:17:24
       return this.firstNumber + this.secondNumber;
     }
   
-    subtract(): number {
-      return this.firstNumber - this.secondNumber;
-    }
+    subtract(): number {}
   
     multiply(): number {
killedBy: CalendarComponent should subtract two numbers
statusReason: Expected undefined to equal -20.

[Killed] ArithmeticOperator
src/app/calendar/calendar.component.ts:18:14
     }
   
     subtract(): number {
-      return this.firstNumber - this.secondNumber;
+      return this.firstNumber + this.secondNumber;
     }
   
killedBy: CalendarComponent should subtract two numbers
statusReason: Expected 120 to equal -20.

[Killed] BlockStatement
src/app/calendar/calendar.component.ts:21:24
       return this.firstNumber - this.secondNumber;
     }
   
-    multiply(): number {
-      return this.firstNumber * this.secondNumber;
-    }
+    multiply(): number {}
   
     divide(): number {
killedBy: CalendarComponent should multiply two numbers
statusReason: Expected undefined to equal 3500.

[Killed] ArithmeticOperator
src/app/calendar/calendar.component.ts:22:14
     }
   
     multiply(): number {
-      return this.firstNumber * this.secondNumber;
+      return this.firstNumber / this.secondNumber;
     }
   
killedBy: CalendarComponent should multiply two numbers
statusReason: Expected 0.7142857142857143 to equal 3500.

[Killed] BlockStatement
src/app/calendar/calendar.component.ts:25:22
       return this.firstNumber * this.secondNumber;
     }
   
-    divide(): number {
-      return this.firstNumber / this.secondNumber;
-    }
+    divide(): number {}
 }
 
killedBy: CalendarComponent should divide two numbers
statusReason: Expected undefined to equal 0.7142857142857143.

[Killed] ArithmeticOperator
src/app/calendar/calendar.component.ts:26:14
     }
   
     divide(): number {
-      return this.firstNumber / this.secondNumber;
+      return this.firstNumber * this.secondNumber;
     }
 }
killedBy: CalendarComponent should divide two numbers
statusReason: Expected 3500 to equal 0.7142857142857143.
